Model: "DenseNet"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            (None, 32, 32, 3)    0                                            
__________________________________________________________________________________________________
conv2d_118 (Conv2D)             (None, 32, 32, 24)   648         input_4[0][0]                    
__________________________________________________________________________________________________
batch_normalization_118 (BatchN (None, 32, 32, 24)   96          conv2d_118[0][0]                 
__________________________________________________________________________________________________
activation_121 (Activation)     (None, 32, 32, 24)   0           batch_normalization_118[0][0]    
__________________________________________________________________________________________________
conv2d_119 (Conv2D)             (None, 32, 32, 48)   1152        activation_121[0][0]             
__________________________________________________________________________________________________
batch_normalization_119 (BatchN (None, 32, 32, 48)   192         conv2d_119[0][0]                 
__________________________________________________________________________________________________
activation_122 (Activation)     (None, 32, 32, 48)   0           batch_normalization_119[0][0]    
__________________________________________________________________________________________________
conv2d_120 (Conv2D)             (None, 32, 32, 12)   5184        activation_122[0][0]             
__________________________________________________________________________________________________
concatenate_55 (Concatenate)    (None, 32, 32, 36)   0           conv2d_118[0][0]                 
                                                                 conv2d_120[0][0]                 
__________________________________________________________________________________________________
batch_normalization_120 (BatchN (None, 32, 32, 36)   144         concatenate_55[0][0]             
__________________________________________________________________________________________________
activation_123 (Activation)     (None, 32, 32, 36)   0           batch_normalization_120[0][0]    
__________________________________________________________________________________________________
conv2d_121 (Conv2D)             (None, 32, 32, 48)   1728        activation_123[0][0]             
__________________________________________________________________________________________________
batch_normalization_121 (BatchN (None, 32, 32, 48)   192         conv2d_121[0][0]                 
__________________________________________________________________________________________________
activation_124 (Activation)     (None, 32, 32, 48)   0           batch_normalization_121[0][0]    
__________________________________________________________________________________________________
conv2d_122 (Conv2D)             (None, 32, 32, 12)   5184        activation_124[0][0]             
__________________________________________________________________________________________________
concatenate_56 (Concatenate)    (None, 32, 32, 48)   0           concatenate_55[0][0]             
                                                                 conv2d_122[0][0]                 
__________________________________________________________________________________________________
batch_normalization_122 (BatchN (None, 32, 32, 48)   192         concatenate_56[0][0]             
__________________________________________________________________________________________________
activation_125 (Activation)     (None, 32, 32, 48)   0           batch_normalization_122[0][0]    
__________________________________________________________________________________________________
conv2d_123 (Conv2D)             (None, 32, 32, 48)   2304        activation_125[0][0]             
__________________________________________________________________________________________________
batch_normalization_123 (BatchN (None, 32, 32, 48)   192         conv2d_123[0][0]                 
__________________________________________________________________________________________________
activation_126 (Activation)     (None, 32, 32, 48)   0           batch_normalization_123[0][0]    
__________________________________________________________________________________________________
conv2d_124 (Conv2D)             (None, 32, 32, 12)   5184        activation_126[0][0]             
__________________________________________________________________________________________________
concatenate_57 (Concatenate)    (None, 32, 32, 60)   0           concatenate_56[0][0]             
                                                                 conv2d_124[0][0]                 
__________________________________________________________________________________________________
batch_normalization_124 (BatchN (None, 32, 32, 60)   240         concatenate_57[0][0]             
__________________________________________________________________________________________________
activation_127 (Activation)     (None, 32, 32, 60)   0           batch_normalization_124[0][0]    
__________________________________________________________________________________________________
conv2d_125 (Conv2D)             (None, 32, 32, 48)   2880        activation_127[0][0]             
__________________________________________________________________________________________________
batch_normalization_125 (BatchN (None, 32, 32, 48)   192         conv2d_125[0][0]                 
__________________________________________________________________________________________________
activation_128 (Activation)     (None, 32, 32, 48)   0           batch_normalization_125[0][0]    
__________________________________________________________________________________________________
conv2d_126 (Conv2D)             (None, 32, 32, 12)   5184        activation_128[0][0]             
__________________________________________________________________________________________________
concatenate_58 (Concatenate)    (None, 32, 32, 72)   0           concatenate_57[0][0]             
                                                                 conv2d_126[0][0]                 
__________________________________________________________________________________________________
batch_normalization_126 (BatchN (None, 32, 32, 72)   288         concatenate_58[0][0]             
__________________________________________________________________________________________________
activation_129 (Activation)     (None, 32, 32, 72)   0           batch_normalization_126[0][0]    
__________________________________________________________________________________________________
conv2d_127 (Conv2D)             (None, 32, 32, 48)   3456        activation_129[0][0]             
__________________________________________________________________________________________________
batch_normalization_127 (BatchN (None, 32, 32, 48)   192         conv2d_127[0][0]                 
__________________________________________________________________________________________________
activation_130 (Activation)     (None, 32, 32, 48)   0           batch_normalization_127[0][0]    
__________________________________________________________________________________________________
conv2d_128 (Conv2D)             (None, 32, 32, 12)   5184        activation_130[0][0]             
__________________________________________________________________________________________________
concatenate_59 (Concatenate)    (None, 32, 32, 84)   0           concatenate_58[0][0]             
                                                                 conv2d_128[0][0]                 
__________________________________________________________________________________________________
batch_normalization_128 (BatchN (None, 32, 32, 84)   336         concatenate_59[0][0]             
__________________________________________________________________________________________________
activation_131 (Activation)     (None, 32, 32, 84)   0           batch_normalization_128[0][0]    
__________________________________________________________________________________________________
conv2d_129 (Conv2D)             (None, 32, 32, 48)   4032        activation_131[0][0]             
__________________________________________________________________________________________________
batch_normalization_129 (BatchN (None, 32, 32, 48)   192         conv2d_129[0][0]                 
__________________________________________________________________________________________________
activation_132 (Activation)     (None, 32, 32, 48)   0           batch_normalization_129[0][0]    
__________________________________________________________________________________________________
conv2d_130 (Conv2D)             (None, 32, 32, 12)   5184        activation_132[0][0]             
__________________________________________________________________________________________________
concatenate_60 (Concatenate)    (None, 32, 32, 96)   0           concatenate_59[0][0]             
                                                                 conv2d_130[0][0]                 
__________________________________________________________________________________________________
batch_normalization_130 (BatchN (None, 32, 32, 96)   384         concatenate_60[0][0]             
__________________________________________________________________________________________________
activation_133 (Activation)     (None, 32, 32, 96)   0           batch_normalization_130[0][0]    
__________________________________________________________________________________________________
conv2d_131 (Conv2D)             (None, 32, 32, 48)   4656        activation_133[0][0]             
__________________________________________________________________________________________________
average_pooling2d_7 (AveragePoo (None, 16, 16, 48)   0           conv2d_131[0][0]                 
__________________________________________________________________________________________________
batch_normalization_131 (BatchN (None, 16, 16, 48)   192         average_pooling2d_7[0][0]        
__________________________________________________________________________________________________
activation_134 (Activation)     (None, 16, 16, 48)   0           batch_normalization_131[0][0]    
__________________________________________________________________________________________________
conv2d_132 (Conv2D)             (None, 16, 16, 48)   2304        activation_134[0][0]             
__________________________________________________________________________________________________
batch_normalization_132 (BatchN (None, 16, 16, 48)   192         conv2d_132[0][0]                 
__________________________________________________________________________________________________
activation_135 (Activation)     (None, 16, 16, 48)   0           batch_normalization_132[0][0]    
__________________________________________________________________________________________________
conv2d_133 (Conv2D)             (None, 16, 16, 12)   5184        activation_135[0][0]             
__________________________________________________________________________________________________
concatenate_61 (Concatenate)    (None, 16, 16, 60)   0           average_pooling2d_7[0][0]        
                                                                 conv2d_133[0][0]                 
__________________________________________________________________________________________________
batch_normalization_133 (BatchN (None, 16, 16, 60)   240         concatenate_61[0][0]             
__________________________________________________________________________________________________
activation_136 (Activation)     (None, 16, 16, 60)   0           batch_normalization_133[0][0]    
__________________________________________________________________________________________________
conv2d_134 (Conv2D)             (None, 16, 16, 48)   2880        activation_136[0][0]             
__________________________________________________________________________________________________
batch_normalization_134 (BatchN (None, 16, 16, 48)   192         conv2d_134[0][0]                 
__________________________________________________________________________________________________
activation_137 (Activation)     (None, 16, 16, 48)   0           batch_normalization_134[0][0]    
__________________________________________________________________________________________________
conv2d_135 (Conv2D)             (None, 16, 16, 12)   5184        activation_137[0][0]             
__________________________________________________________________________________________________
concatenate_62 (Concatenate)    (None, 16, 16, 72)   0           concatenate_61[0][0]             
                                                                 conv2d_135[0][0]                 
__________________________________________________________________________________________________
batch_normalization_135 (BatchN (None, 16, 16, 72)   288         concatenate_62[0][0]             
__________________________________________________________________________________________________
activation_138 (Activation)     (None, 16, 16, 72)   0           batch_normalization_135[0][0]    
__________________________________________________________________________________________________
conv2d_136 (Conv2D)             (None, 16, 16, 48)   3456        activation_138[0][0]             
__________________________________________________________________________________________________
batch_normalization_136 (BatchN (None, 16, 16, 48)   192         conv2d_136[0][0]                 
__________________________________________________________________________________________________
activation_139 (Activation)     (None, 16, 16, 48)   0           batch_normalization_136[0][0]    
__________________________________________________________________________________________________
conv2d_137 (Conv2D)             (None, 16, 16, 12)   5184        activation_139[0][0]             
__________________________________________________________________________________________________
concatenate_63 (Concatenate)    (None, 16, 16, 84)   0           concatenate_62[0][0]             
                                                                 conv2d_137[0][0]                 
__________________________________________________________________________________________________
batch_normalization_137 (BatchN (None, 16, 16, 84)   336         concatenate_63[0][0]             
__________________________________________________________________________________________________
activation_140 (Activation)     (None, 16, 16, 84)   0           batch_normalization_137[0][0]    
__________________________________________________________________________________________________
conv2d_138 (Conv2D)             (None, 16, 16, 48)   4032        activation_140[0][0]             
__________________________________________________________________________________________________
batch_normalization_138 (BatchN (None, 16, 16, 48)   192         conv2d_138[0][0]                 
__________________________________________________________________________________________________
activation_141 (Activation)     (None, 16, 16, 48)   0           batch_normalization_138[0][0]    
__________________________________________________________________________________________________
conv2d_139 (Conv2D)             (None, 16, 16, 12)   5184        activation_141[0][0]             
__________________________________________________________________________________________________
concatenate_64 (Concatenate)    (None, 16, 16, 96)   0           concatenate_63[0][0]             
                                                                 conv2d_139[0][0]                 
__________________________________________________________________________________________________
batch_normalization_139 (BatchN (None, 16, 16, 96)   384         concatenate_64[0][0]             
__________________________________________________________________________________________________
activation_142 (Activation)     (None, 16, 16, 96)   0           batch_normalization_139[0][0]    
__________________________________________________________________________________________________
conv2d_140 (Conv2D)             (None, 16, 16, 48)   4608        activation_142[0][0]             
__________________________________________________________________________________________________
batch_normalization_140 (BatchN (None, 16, 16, 48)   192         conv2d_140[0][0]                 
__________________________________________________________________________________________________
activation_143 (Activation)     (None, 16, 16, 48)   0           batch_normalization_140[0][0]    
__________________________________________________________________________________________________
conv2d_141 (Conv2D)             (None, 16, 16, 12)   5184        activation_143[0][0]             
__________________________________________________________________________________________________
concatenate_65 (Concatenate)    (None, 16, 16, 108)  0           concatenate_64[0][0]             
                                                                 conv2d_141[0][0]                 
__________________________________________________________________________________________________
batch_normalization_141 (BatchN (None, 16, 16, 108)  432         concatenate_65[0][0]             
__________________________________________________________________________________________________
activation_144 (Activation)     (None, 16, 16, 108)  0           batch_normalization_141[0][0]    
__________________________________________________________________________________________________
conv2d_142 (Conv2D)             (None, 16, 16, 48)   5184        activation_144[0][0]             
__________________________________________________________________________________________________
batch_normalization_142 (BatchN (None, 16, 16, 48)   192         conv2d_142[0][0]                 
__________________________________________________________________________________________________
activation_145 (Activation)     (None, 16, 16, 48)   0           batch_normalization_142[0][0]    
__________________________________________________________________________________________________
conv2d_143 (Conv2D)             (None, 16, 16, 12)   5184        activation_145[0][0]             
__________________________________________________________________________________________________
concatenate_66 (Concatenate)    (None, 16, 16, 120)  0           concatenate_65[0][0]             
                                                                 conv2d_143[0][0]                 
__________________________________________________________________________________________________
batch_normalization_143 (BatchN (None, 16, 16, 120)  480         concatenate_66[0][0]             
__________________________________________________________________________________________________
activation_146 (Activation)     (None, 16, 16, 120)  0           batch_normalization_143[0][0]    
__________________________________________________________________________________________________
conv2d_144 (Conv2D)             (None, 16, 16, 60)   7260        activation_146[0][0]             
__________________________________________________________________________________________________
average_pooling2d_8 (AveragePoo (None, 8, 8, 60)     0           conv2d_144[0][0]                 
__________________________________________________________________________________________________
batch_normalization_144 (BatchN (None, 8, 8, 60)     240         average_pooling2d_8[0][0]        
__________________________________________________________________________________________________
activation_147 (Activation)     (None, 8, 8, 60)     0           batch_normalization_144[0][0]    
__________________________________________________________________________________________________
conv2d_145 (Conv2D)             (None, 8, 8, 48)     2880        activation_147[0][0]             
__________________________________________________________________________________________________
batch_normalization_145 (BatchN (None, 8, 8, 48)     192         conv2d_145[0][0]                 
__________________________________________________________________________________________________
activation_148 (Activation)     (None, 8, 8, 48)     0           batch_normalization_145[0][0]    
__________________________________________________________________________________________________
conv2d_146 (Conv2D)             (None, 8, 8, 12)     5184        activation_148[0][0]             
__________________________________________________________________________________________________
concatenate_67 (Concatenate)    (None, 8, 8, 72)     0           average_pooling2d_8[0][0]        
                                                                 conv2d_146[0][0]                 
__________________________________________________________________________________________________
batch_normalization_146 (BatchN (None, 8, 8, 72)     288         concatenate_67[0][0]             
__________________________________________________________________________________________________
activation_149 (Activation)     (None, 8, 8, 72)     0           batch_normalization_146[0][0]    
__________________________________________________________________________________________________
conv2d_147 (Conv2D)             (None, 8, 8, 48)     3456        activation_149[0][0]             
__________________________________________________________________________________________________
batch_normalization_147 (BatchN (None, 8, 8, 48)     192         conv2d_147[0][0]                 
__________________________________________________________________________________________________
activation_150 (Activation)     (None, 8, 8, 48)     0           batch_normalization_147[0][0]    
__________________________________________________________________________________________________
conv2d_148 (Conv2D)             (None, 8, 8, 12)     5184        activation_150[0][0]             
__________________________________________________________________________________________________
concatenate_68 (Concatenate)    (None, 8, 8, 84)     0           concatenate_67[0][0]             
                                                                 conv2d_148[0][0]                 
__________________________________________________________________________________________________
batch_normalization_148 (BatchN (None, 8, 8, 84)     336         concatenate_68[0][0]             
__________________________________________________________________________________________________
activation_151 (Activation)     (None, 8, 8, 84)     0           batch_normalization_148[0][0]    
__________________________________________________________________________________________________
conv2d_149 (Conv2D)             (None, 8, 8, 48)     4032        activation_151[0][0]             
__________________________________________________________________________________________________
batch_normalization_149 (BatchN (None, 8, 8, 48)     192         conv2d_149[0][0]                 
__________________________________________________________________________________________________
activation_152 (Activation)     (None, 8, 8, 48)     0           batch_normalization_149[0][0]    
__________________________________________________________________________________________________
conv2d_150 (Conv2D)             (None, 8, 8, 12)     5184        activation_152[0][0]             
__________________________________________________________________________________________________
concatenate_69 (Concatenate)    (None, 8, 8, 96)     0           concatenate_68[0][0]             
                                                                 conv2d_150[0][0]                 
__________________________________________________________________________________________________
batch_normalization_150 (BatchN (None, 8, 8, 96)     384         concatenate_69[0][0]             
__________________________________________________________________________________________________
activation_153 (Activation)     (None, 8, 8, 96)     0           batch_normalization_150[0][0]    
__________________________________________________________________________________________________
conv2d_151 (Conv2D)             (None, 8, 8, 48)     4608        activation_153[0][0]             
__________________________________________________________________________________________________
batch_normalization_151 (BatchN (None, 8, 8, 48)     192         conv2d_151[0][0]                 
__________________________________________________________________________________________________
activation_154 (Activation)     (None, 8, 8, 48)     0           batch_normalization_151[0][0]    
__________________________________________________________________________________________________
conv2d_152 (Conv2D)             (None, 8, 8, 12)     5184        activation_154[0][0]             
__________________________________________________________________________________________________
concatenate_70 (Concatenate)    (None, 8, 8, 108)    0           concatenate_69[0][0]             
                                                                 conv2d_152[0][0]                 
__________________________________________________________________________________________________
batch_normalization_152 (BatchN (None, 8, 8, 108)    432         concatenate_70[0][0]             
__________________________________________________________________________________________________
activation_155 (Activation)     (None, 8, 8, 108)    0           batch_normalization_152[0][0]    
__________________________________________________________________________________________________
conv2d_153 (Conv2D)             (None, 8, 8, 48)     5184        activation_155[0][0]             
__________________________________________________________________________________________________
batch_normalization_153 (BatchN (None, 8, 8, 48)     192         conv2d_153[0][0]                 
__________________________________________________________________________________________________
activation_156 (Activation)     (None, 8, 8, 48)     0           batch_normalization_153[0][0]    
__________________________________________________________________________________________________
conv2d_154 (Conv2D)             (None, 8, 8, 12)     5184        activation_156[0][0]             
__________________________________________________________________________________________________
concatenate_71 (Concatenate)    (None, 8, 8, 120)    0           concatenate_70[0][0]             
                                                                 conv2d_154[0][0]                 
__________________________________________________________________________________________________
batch_normalization_154 (BatchN (None, 8, 8, 120)    480         concatenate_71[0][0]             
__________________________________________________________________________________________________
activation_157 (Activation)     (None, 8, 8, 120)    0           batch_normalization_154[0][0]    
__________________________________________________________________________________________________
conv2d_155 (Conv2D)             (None, 8, 8, 48)     5760        activation_157[0][0]             
__________________________________________________________________________________________________
batch_normalization_155 (BatchN (None, 8, 8, 48)     192         conv2d_155[0][0]                 
__________________________________________________________________________________________________
activation_158 (Activation)     (None, 8, 8, 48)     0           batch_normalization_155[0][0]    
__________________________________________________________________________________________________
conv2d_156 (Conv2D)             (None, 8, 8, 12)     5184        activation_158[0][0]             
__________________________________________________________________________________________________
concatenate_72 (Concatenate)    (None, 8, 8, 132)    0           concatenate_71[0][0]             
                                                                 conv2d_156[0][0]                 
__________________________________________________________________________________________________
batch_normalization_156 (BatchN (None, 8, 8, 132)    528         concatenate_72[0][0]             
__________________________________________________________________________________________________
activation_159 (Activation)     (None, 8, 8, 132)    0           batch_normalization_156[0][0]    
__________________________________________________________________________________________________
global_average_pooling2d_4 (Glo (None, 132)          0           activation_159[0][0]             
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 10)           1330        global_average_pooling2d_4[0][0] 
__________________________________________________________________________________________________
activation_160 (Activation)     (None, 10)           0           dense_4[0][0]                    
==================================================================================================
Total params: 181,318
Trainable params: 176,230
Non-trainable params: 5,088
___________________________________